public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
/*
 * Мессенджер:
 * 1.Ввоить ник
 * 1.1 Должен быть только латинскими буквами
 * 1.2 Должен быть не менее 5 символов
 * 1.3 Не должен начинаться с цифр
 * 1.4 Не должен содержать #,!,\
 * 2. Сообщения вводятся через консоль
 * 3. Сообщения храняться в массиве
 * 4. Можно отредактировать свое сообщение если оно не старее минуты
 * 5. Можно писать отложенные сообщения
 * */

/*
 * 1) User[login,Passwort
 * 2) Validate[checkpass()
 * 3) Dialogs
 * 4) InputDialogs
 * 5) Message
 * 6) InputMessage
 *
 * */